# Логвинов Федор - "Cyber - Rush"

### Группа: 11 - Г - 1

**[ НАЗВАНИЕ ПРОЕКТА ]**

“Cyber - Rush”

**[ ПРОБЛЕМНОЕ ПОЛЕ ]**

Мой проект нужен для создания нового типа пошаговых стратегий на рынке видеоигр, так как игр, подобных этой, существует очень малое количество.
Моя игра решит проблему, практически, полного отсутствия нелинейных пошаговых стратегий на рынке.

**[ ЗАКАЗЧИК / ПОТЕНЦИАЛЬНАЯ АУДИТОРИЯ ]**

Программный продукт может заинтересовать любителей стратегических игр

* игроки, предпочитающие жанр «стратегия»
* игроки, предпочитающие 2D графику в играх
* игроки, предпочитающие «RPG» элементы в играх

**[ АППАРАТНЫЕ / ПРОГРАММНЫЕ ТРЕБОВАНИЯ ]** 

Продукт разрабатывается под операционную систему Windows

* Минимальные требования - Windows 10 – 4 Гб оперативной памяти и 1 Гб свободного места на жестком диске 

**[ ФУНКЦИОНАЛЬНЫЕ ТРЕБОВАНИЯ ]**

Продукт будет предоставлять следующие возможности:

* Пошаговая стратегия, с глубоким сюжетом, в сеттинге киберпанка, с большим количеством диалогов и выборов, которые будут влиять на прохождение. 
* Масштаб(время прохождения): 4-6 часов
* Тираж: бесконечный ( в онлайн магазинах видеоигр )
* Материал ( инструменты создания ): «RPG Maker MV», «Music Forge», «Pixel Studio»
* Многоразовая реиграбельность, 4 концовки игры
* Только для Windows
* Нетребовательность к мощностям игрового ПК
* Составление собственных колод для боя
* Пошаговые сражения

**[ ПОХОЖИЕ / АНАЛОГИЧНЫЕ ПРОДУКТЫ ]**

* Darkest Dungeon 
* One step from Eden

**[ ИНСТРУМЕНТЫ РАЗРАБОТКИ, ИНФОРМАЦИЯ О БД ]**

*	«RPG Maker MV» на JavaScript
*	«Music Forge»
*	«Pixel Studio»	

**[ ЭТАПЫ РАЗРАБОТКИ ]**

*	Разработка сценрия
*	Анализ игровых механик
*	Создание новых игровых механик
*	Отрисовка можелей и спрайтов
*	Написание кода игры
* Соединение всего вышеперечисленного 
*	Тестирование продукта
*	Подготовка проекта к защите

**[ ВОЗМОЖНЫЕ РИСКИ ]**
* Риски
* 1. Большое количество багов и ошибок в игре
* 2. Не интересный и запутанный сюжет
* 3. Малая продолжительность игры
* Решения
* 1. Углубление знаний в области программирования и исправление ошибок
* 2. Подача частей сюжета через диалоги с персонажами и окружение
* 3. Упор игры на реиграбельность и нелинейность, что заинтересует игроков в повторных прохождениях игры, что будет сопровождаться новыми событиями и новыми концовками игры
